maincases/both_400/system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager    steadyOptimisation;

primalSolvers
{
    p1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;
        solutionControls
        {
            nIters 3000;
            residualControl
            {
                "p.*"       1.e-8;
                "U.*"       1.e-8;
            }
        }
    }
}

adjointManagers
{
    am1
    {
        primalSolver             p1;
        adjointSolvers
        {
            as1
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;

                // manage objectives
                //------------------
                objectives
                {
                    type            incompressible;
                    objectiveNames
                    {
                        lift
                        {
                            weight          0.9;
                            type            force;
                            patches         (Airfoil);
                            direction      (0.0871557427 -0.996194698 0); 
                            Aref            1.;
                            rhoInf          1;
                            UInf            1;
                        }
			drag
                        {
                            weight          0.7;
                            type            force;
                            patches         (Airfoil);
                            direction      (0.996194698 0.0871557427 0);
                            Aref            1.;
                            rhoInf          1;
                            UInf            1;
                        }
                    }
                }

                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel        standard;
                }

                // solution control
                //------------------
                solutionControls
                {
                    nIters 3000;
                    residualControl
                    {
                        "pa.*"       1.e-8;
                        "Ua.*"       1.e-8;
                    }
                }
            }

           // vol
           // {
           //     // choose adjoint solver
          //      //----------------------
          //      active                 true;
           //     type                   null;
            //    isConstraint           true;

                // manage objectives
                //------------------
              //  objectives
               // {
                //    type                geometric;
                 //   objectiveNames
                  //  {
                   //     vol
                    //    {
                     //       weight         1;
                      //      type            partialVolume;
                       //     patches         (Airfoil);
                       // }
                   // }
               // }
           // }
        }
    }
}

optimisation
{
    designVariables
    {
        type            shape;
        shapeType       volumetricBSplines;
        sensitivityType shapeFI;
        patches         (Airfoil);
        maxInitChange   5.e-3;  // Very conservative initially
        writeEachMesh   true;
    }

    updateMethod
    {
        method          steepestDescent;
    }
}


// ************************************************************************* //
